---
type: DuplicateTypeNamesHandlerArgs
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# DuplicateTypeNamesHandlerArgs

`Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetTypeIds | 2014 | `public ICollection < ElementId > GetTypeIds ()` |
| Property | Document | 2014 | `public Document Document { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |